
النص = "انا احب البرمجة. انا احب القراءة. انا احب اللعب. هي تحب الرسم."

كلمات = النص.replace(".", "").split()

الاقتراحات = {}

for i in range(len(كلمات) - 1):
    كلمة_حالية = كلمات[i]
    كلمة_تالية = كلمات[i + 1]

    if كلمة_حالية not in الاقتراحات:
        الاقتراحات[كلمة_حالية] = []

    الاقتراحات[كلمة_حالية].append(كلمة_تالية)


def اقترح_كلمة(كلمة):
    if كلمة in الاقتراحات:
        return الاقتراحات[كلمة][0]   # بترجع أول اقتراح لقيناه
    else:
        return "مفيش اقتراح"


print("اكتب كلمة وشوف اقتراح البرنامج للكلمة اللي بعدها ")
print()

for كلمة in ["انا", "هي", "احب"]:
    اقتراح = اقترح_كلمة(كلمة)
    print(f"لو كتبت: '{كلمة}'  -->  البرنامج يقترح: '{اقتراح}'")
